[
    {
        "id": 1,
        "title": "The Power of a Sip of Water",
        "content": "The Prophet (ﷺ) told a story of a man who was walking on a road and became very thirsty. He found a well, climbed down, and drank. When he came out, he saw a panting dog eating mud out of extreme thirst. The man thought, 'This dog is as thirsty as I was.' So he climbed back down, filled his shoe with water, and gave it to the dog. Allah thanked him for this deed and forgave his sins.",
        "source": "Sahih Al-Bukhari 2466"
    },
    {
        "id": 2,
        "title": "The Woman Who Cleaned the Mosque",
        "content": "A black woman used to clean the mosque during the time of the Prophet (ﷺ). One day, the Prophet did not see her and asked about her. The companions said, 'She has died.' He said, 'Why did you not inform me?' He went to her grave and prayed the funeral prayer for her, showing that even the simplest service to Allah's house is honored.",
        "source": "Sahih Al-Bukhari 458"
    },
    {
        "id": 3,
        "title": "The Weight of Good Character",
        "content": "The Prophet (ﷺ) said: 'Nothing is heavier on the Scale of the believer on the Day of Resurrection than good character. For indeed Allah hates the one who is rude and vulgar.'",
        "source": "Jami` at-Tirmidhi 2002"
    },
    {
        "id": 4,
        "title": "Do Not Belittle Good Deeds",
        "content": "The Prophet (ﷺ) said: 'Do not belittle any good deed, even meeting your brother with a cheerful face.'",
        "source": "Sahih Muslim 2626"
    },
    {
        "id": 5,
        "title": "The Man Who Killed 99 People",
        "content": "The Prophet (ﷺ) told of a man who killed 99 people but sought repentance. He was told to go to a town of righteous people. He died halfway there. The angels of mercy and punishment argued over him. Allah commanded the earth to shift, making him closer to the righteous town by a handspan, and he was forgiven.",
        "source": "Sahih Al-Bukhari 3470"
    },
    {
        "id": 6,
        "title": "Mercy to the Universe",
        "content": "The Prophet (ﷺ) recited the verse where Ibrahim (AS) prayed for his people, and the verse where Isa (AS) prayed for his people. Then he raised his hands and said, 'O Allah! My Ummah! My Ummah!' and he wept. Allah sent Jibril to say: 'We will please you with regard to your Ummah and We will not disappoint you.'",
        "source": "Sahih Muslim 202"
    },
    {
        "id": 7,
        "title": "Half a Date",
        "content": "The Prophet (ﷺ) said: 'Guard yourselves against the Fire, even with half a date (given in charity). And if you cannot find that, then with a kind word.'",
        "source": "Sahih Al-Bukhari 1417"
    },
    {
        "id": 8,
        "title": "The Best of You",
        "content": "The Prophet (ﷺ) said: 'The best of you are those who learn the Quran and teach it.'",
        "source": "Sahih Al-Bukhari 5027"
    },
    {
        "id": 9,
        "title": "Visiting the Sick",
        "content": "The Prophet (ﷺ) said: 'When a Muslim visits his sick brother, he is harvesting the fruits of Paradise until he returns.'",
        "source": "Sahih Muslim 2568"
    },
    {
        "id": 10,
        "title": "Love for Your Brother",
        "content": "The Prophet (ﷺ) said: 'None of you truly believes until he loves for his brother what he loves for himself.'",
        "source": "Sahih Al-Bukhari 13"
    }
]